; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl)

(:types link joint angle)

(:predicates
	(Connected ?j - joint ?l - link) 
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?a - angle ?j - joint)
)

(:action increase_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(Connected ?joint ?link1)
	(Connected ?joint ?link2)
	(not (= ?link1 ?link2))
	(HasAngle ?a1 ?joint)
	(AngleOrd ?a1 ?a2)
	)
:effect (and 
	(not (HasAngle ?a1 ?joint)) 
	(HasAngle ?a2 ?joint)
	)
)

(:action decrease_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(Connected ?joint ?link1)
	(Connected ?joint ?link2)
	(not (= ?link1 ?link2))
	(HasAngle ?a1 ?joint)
	(AngleOrd ?a2 ?a1)
	)
:effect (and 
	(not (HasAngle ?a1 ?joint)) 
	(HasAngle ?a2 ?joint)
	)
)
)

; problem
(define (problem joint_bar_1)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 link8 link9 link10 - link
    joint1 joint2 joint3 joint4 joint5 joint6 joint7 joint8 joint9 - joint
    angle0 angle90 angle180 angle270 - angle)
(:init
    (AngleOrd angle0 angle90)
    (AngleOrd angle90 angle180)
    (AngleOrd angle180 angle270)
    (AngleOrd angle270 angle0)

    (Connected joint1 link1)
    (Connected joint1 link2)
    (Connected joint2 link2)
    (Connected joint2 link3)
    (Connected joint3 link3)
    (Connected joint3 link4)
    (Connected joint4 link4)
    (Connected joint4 link5)
    (Connected joint5 link5)
    (Connected joint5 link6)
    (Connected joint6 link6)
    (Connected joint6 link7)
    (Connected joint7 link7)
    (Connected joint7 link8)
    (Connected joint8 link8)
    (Connected joint8 link9)
    (Connected joint9 link9)
    (Connected joint9 link10)

    (HasAngle angle90 joint1)
    (HasAngle angle0 joint2)
    (HasAngle angle180 joint3)
    (HasAngle angle0 joint4)
    (HasAngle angle0 joint5)
    (HasAngle angle0 joint6)
    (HasAngle angle90 joint7)
    (HasAngle angle180 joint8)
    (HasAngle angle180 joint9)
)
(:goal
(and
    (HasAngle angle0 joint1)
    (HasAngle angle90 joint2)
    (HasAngle angle270 joint3)
    (HasAngle angle0 joint4)
    (HasAngle angle0 joint5)
    (HasAngle angle270 joint6)
    (HasAngle angle180 joint7)
    (HasAngle angle0 joint8)
    (HasAngle angle270 joint9)
    )
)
)

; plan
1. (decrease_angle link1 link2 joint1 angle90 angle0)
   deleted: (hasangle angle90 joint1)
   added: (hasangle angle0 joint1)
   goals met: 3 of 9
2. (decrease_angle link7 link6 joint6 angle0 angle270)
   deleted: (hasangle angle0 joint6)
   added: (hasangle angle270 joint6)
   goals met: 4 of 9
3. (decrease_angle link8 link9 joint8 angle180 angle90)
   deleted: (hasangle angle180 joint8)
   added: (hasangle angle90 joint8)
   goals met: 4 of 9
4. (increase_angle link10 link9 joint9 angle180 angle270)
   deleted: (hasangle angle180 joint9)
   added: (hasangle angle270 joint9)
   goals met: 5 of 9
5. (increase_angle link3 link2 joint2 angle0 angle90)
   deleted: (hasangle angle0 joint2)
   added: (hasangle angle90 joint2)
   goals met: 6 of 9
6. (increase_angle link4 link3 joint3 angle180 angle270)
   deleted: (hasangle angle180 joint3)
   added: (hasangle angle270 joint3)
   goals met: 7 of 9
7. (increase_angle link8 link7 joint7 angle90 angle180)
   deleted: (hasangle angle90 joint7)
   added: (hasangle angle180 joint7)
   goals met: 8 of 9
8. (decrease_angle link9 link8 joint8 angle90 angle0)
   deleted: (hasangle angle90 joint8)
   added: (hasangle angle0 joint8)
   goals met: 9 of 9
